INSERT INTO Lecture (
  lecture_name,
  lecture_year,
  enrollment_count,
  credit,
  lecture_semester,
  day_of_week,
  start_hours,
  end_hours,
  room,
  professor_id
) VALUES
-- 월요일 6교시
('컴퓨터네트워크', '2025', 29, 3, 2, '월', '15:00:00', '15:50:00', 'D202', NULL),

-- 화요일 1교시
('인공지능개론', '2025', 26, 3, 2, '화', '09:00:00', '09:50:00', 'D202', NULL),

-- 수요일 2교시
('소프트웨어공학', '2025', 33, 3, 2, '수', '10:00:00', '10:50:00', 'D202', NULL),

-- 목요일 3교시
('모바일프로그래밍', '2025', 25, 3, 2, '목', '11:00:00', '11:50:00', 'D202', NULL),

-- 금요일 4교시
('컴파일러', '2025', 20, 3, 2, '금', '13:00:00', '13:50:00', 'D202', NULL);